#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
module.networks.google_compute_address.duc_bac_nat_ip: Refreshing state... [id=projects/infrateam-playground/regions/asia-southeast1/addresses/duc-bac-nat-ip]
module.networks.google_compute_network.duc_bac_cloudrun_network: Refreshing state... [id=projects/infrateam-playground/global/networks/duc-bac-cloudrun-network]
module.networks.google_compute_router.duc_bac_router: Refreshing state... [id=projects/infrateam-playground/regions/asia-southeast1/routers/duc-bac-router]
module.networks.google_compute_subnetwork.duc_bac_subnetwork: Refreshing state... [id=projects/infrateam-playground/regions/asia-southeast1/subnetworks/duc-bac-subnetwork]
module.networks.google_vpc_access_connector.duc_bac_serverless_vpc_connector: Refreshing state... [id=projects/infrateam-playground/locations/asia-southeast1/connectors/duc-bac-vpc-connector]
module.networks.google_compute_router_nat.duc_bac_nat_gateway: Refreshing state... [id=infrateam-playground/asia-southeast1/duc-bac-router/duc-bac-nat-gateway]
google_cloud_run_service.duc-bac-nginx-service: Refreshing state... [id=locations/asia-southeast1/namespaces/infrateam-playground/services/duc-bac-nginx-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service_iam_member.duc-bac-nginx-service-invoker will be created
  + resource "google_cloud_run_service_iam_member" "duc-bac-nginx-service-invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-southeast1"
      + member   = "allUsers"
      + project  = "infrateam-playground"
      + role     = "roles/run.invoker"
      + service  = "duc-bac-nginx-service"
    }

  # google_cloud_scheduler_job.jobs["duc-bac-nginx-job"] will be created
  + resource "google_cloud_scheduler_job" "jobs" {
      + attempt_deadline = "320s"
      + description      = "Job to trigger the Nginx Cloud Run service"
      + id               = (known after apply)
      + name             = "duc-bac-nginx-job"
      + paused           = (known after apply)
      + project          = "infrateam-playground"
      + region           = "asia-southeast1"
      + schedule         = "0 15 * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Singapore"

      + http_target {
          + http_method = "GET"
          + uri         = "https://duc-bac-nginx-service-1046428081626.asia-southeast1.run.app"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @bacducdinh, Action: `pull_request`*